
&НаКлиенте
АСИНХ Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	НазваниеТовара = Ждать ВвестиСтрокуАсинх("", "Введите название товара");
	
	Если ПроверитьСуществованияТовара(НазваниеТовара) Тогда
		ТекстСообщения = СтрШаблон("Товар %1 найден", НазваниеТовара);
	Иначе
		ТекстСообщения = СтрШаблон("Товар %1 не найден", НазваниеТовара);
	КонецЕсли;
	
	Сообщить(ТекстСообщения);
КонецПроцедуры

Функция ПроверитьСуществованияТовара(НазваниеТовара)
	ТоварСуществует = Справочники.Товары.ПроверитьСуществованиеПоНазванию(НазваниеТовара);
	Возврат ТоварСуществует;
КонецФункции